---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.#ctor
source: html/c679f8b2-be10-b576-0b37-527c9e7b8ad2.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.#ctor Method

Initializes a new instance of the CurveByPointsArray class

## Syntax (C#)
```csharp
public CurveByPointsArray()
```